{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# نمایش خروجی ها به صورت گراف"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph(password=\"Zblock.IR\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "A = graph.data(\"MATCH (block :block)<-[:inc]-(tx :tx) WHERE block.height=57043 RETURN tx\")\n",
    "# Finds all non-coinbase transactions in the first 1000 blocks\n",
    "B = graph.data(\"MATCH (block:block)-[:inc]-(tx:tx) WHERE block.height < 1000  AND not exists((tx)<-[:in]-(:coinbase))  RETURN block.height AS block, tx.txid AS transaction, size((tx)<-[:in]-()) AS inputs, size((tx)-[:out]->()) AS outputs, tx.fee / tx.size AS fee_satoshis_per_byte ORDER BY block\")\n",
    "# This query allows you to see if two address are connected by a series of transactions. It also returns a path if there are common intermediary addresses.\n",
    "C = graph.data(\"MATCH (start :address {address:'17SkEw2md5avVNyYgj6RiXuQKNwkXaxFyQ'}), (end :address {address:'1XPTgDRhN8RFnzniWCddobD9iKZatrvH4'}) MATCH path=shortestPath( (start)-[:in|:out|:locked*]-(end) ) RETURN path\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'path': (ee42159)<-[:locked]-(f061500)<-[:out {vout:0}]-(f5320b6)<-[:in {scriptSig:\"47304402203d39f56560c75f8bc63eef075781550c5406559d1a1822b236e58a1983600a3d02204d329b5dc23a03c4d79311020818fb6a5fea904b4255815d213c3d72f1a2552701410434417dd8d89deaf0f6481c2c160d6de0921624ef7b956f38eef9ed4a64e36877be84b77cdee5a8d92b7d93694f89c3011bf1cbdf4fd7d8ca13b58a7bb4ab0804\",sequence:\"4294967295\",vin:121}]-(e98e85b)-[:locked]->(e12be02)}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "C"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext py_d3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "<script>\n",
       "requirejs.config({\n",
       "    paths: {\n",
       "        d3: \"//cdnjs.cloudflare.com/ajax/libs/d3/4.13.0/d3\"\n",
       "    }\n",
       "});\n",
       "\n",
       "require([\"d3\"], function(d3) {\n",
       "    window.d3 = d3;\n",
       "});\n",
       "</script>\n",
       "<script>\n",
       "_select = d3.select;\n",
       "\n",
       "d3.select0 = function(selection) {\n",
       "    return _select(\"#d3-cell-0\").select(selection);\n",
       "}\n",
       "d3.selectAll0 = function(selection) {\n",
       "    return _select(\"#d3-cell-0\").selectAll(selection);\n",
       "}\n",
       "</script>\n",
       "\n",
       "<g id=\"d3-cell-0\">\n",
       "        <style>\n",
       "\n",
       ".links line {\n",
       "  stroke: #999;\n",
       "  stroke-opacity: 0.6;\n",
       "}\n",
       "\n",
       ".nodes circle {\n",
       "  stroke: #fff;\n",
       "  stroke-width: 1.5px;\n",
       "}\n",
       "\n",
       "</style>\n",
       "\n",
       "<svg width=\"960\" height=\"600\"></svg>\n",
       "\n",
       "<script>\n",
       "\n",
       "var svg = d3.select0(\"svg\"),\n",
       "    width = +svg.attr(\"width\"),\n",
       "    height = +svg.attr(\"height\");\n",
       "\n",
       "var color = d3.scaleOrdinal(d3.schemeCategory20);\n",
       "\n",
       "var simulation = d3.forceSimulation()\n",
       "    .force(\"link\", d3.forceLink().id(function(d) { return d.id; }))\n",
       "    .force(\"charge\", d3.forceManyBody())\n",
       "    .force(\"center\", d3.forceCenter(width / 2, height / 2));\n",
       "\n",
       "d3.json(\"./Visualization/miserables.json\", function(error, graph) {\n",
       "  if (error) throw error;\n",
       "\n",
       "  var link = svg.append(\"g\")\n",
       "      .attr(\"class\", \"links\")\n",
       "    .selectAll(\"line\")\n",
       "    .data(graph.links)\n",
       "    .enter().append(\"line\")\n",
       "      .attr(\"stroke-width\", function(d) { return Math.sqrt(d.value); });\n",
       "\n",
       "  var node = svg.append(\"g\")\n",
       "      .attr(\"class\", \"nodes\")\n",
       "    .selectAll(\"circle\")\n",
       "    .data(graph.nodes)\n",
       "    .enter().append(\"circle\")\n",
       "      .attr(\"r\", 5)\n",
       "      .attr(\"fill\", function(d) { return color(d.group); })\n",
       "      .call(d3.drag()\n",
       "          .on(\"start\", dragstarted)\n",
       "          .on(\"drag\", dragged)\n",
       "          .on(\"end\", dragended));\n",
       "\n",
       "  node.append(\"title\")\n",
       "      .text(function(d) { return d.id; });\n",
       "\n",
       "  simulation\n",
       "      .nodes(graph.nodes)\n",
       "      .on(\"tick\", ticked);\n",
       "\n",
       "  simulation.force(\"link\")\n",
       "      .links(graph.links);\n",
       "\n",
       "  function ticked() {\n",
       "    link\n",
       "        .attr(\"x1\", function(d) { return d.source.x; })\n",
       "        .attr(\"y1\", function(d) { return d.source.y; })\n",
       "        .attr(\"x2\", function(d) { return d.target.x; })\n",
       "        .attr(\"y2\", function(d) { return d.target.y; });\n",
       "\n",
       "    node\n",
       "        .attr(\"cx\", function(d) { return d.x; })\n",
       "        .attr(\"cy\", function(d) { return d.y; });\n",
       "  }\n",
       "});\n",
       "\n",
       "function dragstarted(d) {\n",
       "  if (!d3.event.active) simulation.alphaTarget(0.3).restart();\n",
       "  d.fx = d.x;\n",
       "  d.fy = d.y;\n",
       "}\n",
       "\n",
       "function dragged(d) {\n",
       "  d.fx = d3.event.x;\n",
       "  d.fy = d3.event.y;\n",
       "}\n",
       "\n",
       "function dragended(d) {\n",
       "  if (!d3.event.active) simulation.alphaTarget(0);\n",
       "  d.fx = null;\n",
       "  d.fy = null;\n",
       "}\n",
       "\n",
       "</script>\n",
       "</g>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%d3 \n",
    "<style>\n",
    "\n",
    ".links line {\n",
    "  stroke: #999;\n",
    "  stroke-opacity: 0.6;\n",
    "}\n",
    "\n",
    ".nodes circle {\n",
    "  stroke: #fff;\n",
    "  stroke-width: 1.5px;\n",
    "}\n",
    "\n",
    "</style>\n",
    "\n",
    "<svg width=\"960\" height=\"600\"></svg>\n",
    "\n",
    "<script>\n",
    "\n",
    "var svg = d3.select(\"svg\"),\n",
    "    width = +svg.attr(\"width\"),\n",
    "    height = +svg.attr(\"height\");\n",
    "\n",
    "var color = d3.scaleOrdinal(d3.schemeCategory20);\n",
    "\n",
    "var simulation = d3.forceSimulation()\n",
    "    .force(\"link\", d3.forceLink().id(function(d) { return d.id; }))\n",
    "    .force(\"charge\", d3.forceManyBody())\n",
    "    .force(\"center\", d3.forceCenter(width / 2, height / 2));\n",
    "\n",
    "d3.json(\"./Visualization/miserables.json\", function(error, graph) {\n",
    "  if (error) throw error;\n",
    "\n",
    "  var link = svg.append(\"g\")\n",
    "      .attr(\"class\", \"links\")\n",
    "    .selectAll(\"line\")\n",
    "    .data(graph.links)\n",
    "    .enter().append(\"line\")\n",
    "      .attr(\"stroke-width\", function(d) { return Math.sqrt(d.value); });\n",
    "\n",
    "  var node = svg.append(\"g\")\n",
    "      .attr(\"class\", \"nodes\")\n",
    "    .selectAll(\"circle\")\n",
    "    .data(graph.nodes)\n",
    "    .enter().append(\"circle\")\n",
    "      .attr(\"r\", 5)\n",
    "      .attr(\"fill\", function(d) { return color(d.group); })\n",
    "      .call(d3.drag()\n",
    "          .on(\"start\", dragstarted)\n",
    "          .on(\"drag\", dragged)\n",
    "          .on(\"end\", dragended));\n",
    "\n",
    "  node.append(\"title\")\n",
    "      .text(function(d) { return d.id; });\n",
    "\n",
    "  simulation\n",
    "      .nodes(graph.nodes)\n",
    "      .on(\"tick\", ticked);\n",
    "\n",
    "  simulation.force(\"link\")\n",
    "      .links(graph.links);\n",
    "\n",
    "  function ticked() {\n",
    "    link\n",
    "        .attr(\"x1\", function(d) { return d.source.x; })\n",
    "        .attr(\"y1\", function(d) { return d.source.y; })\n",
    "        .attr(\"x2\", function(d) { return d.target.x; })\n",
    "        .attr(\"y2\", function(d) { return d.target.y; });\n",
    "\n",
    "    node\n",
    "        .attr(\"cx\", function(d) { return d.x; })\n",
    "        .attr(\"cy\", function(d) { return d.y; });\n",
    "  }\n",
    "});\n",
    "\n",
    "function dragstarted(d) {\n",
    "  if (!d3.event.active) simulation.alphaTarget(0.3).restart();\n",
    "  d.fx = d.x;\n",
    "  d.fy = d.y;\n",
    "}\n",
    "\n",
    "function dragged(d) {\n",
    "  d.fx = d3.event.x;\n",
    "  d.fy = d3.event.y;\n",
    "}\n",
    "\n",
    "function dragended(d) {\n",
    "  if (!d3.event.active) simulation.alphaTarget(0);\n",
    "  d.fx = null;\n",
    "  d.fy = null;\n",
    "}\n",
    "\n",
    "</script>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
